---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeSettings.Centerline
source: html/c1bb6ed5-c673-eb76-df28-c0d430272cb2.htm
---
# Autodesk.Revit.DB.Plumbing.PipeSettings.Centerline Property

The abbreviation of the Centerline (=) string.

## Syntax (C#)
```csharp
public string Centerline { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null